In [1]:
import pandas as pd

In [2]:
# Creating a dictionary with the data
data = {
    'Name': ['Abhi', 'Bob', 'Charlie', 'David', 'Ella', 'Frank', 'Gina', 'Henry', 'Ivy', 'John', 
             'Karen', 'Liam', 'Mary', 'Nate', 'Olivia', 'Peter', 'Queen', 'Rachel', 'Samantha', 'Tom'],
    'Age': [23, 34, 29, 45, 21, 26, 38, 52, 28, 41, 37, 29, 43, 25, 27, 31, 46, 33, 39, 22],
    'Salary': [105000, 65000, 72000, 82000, 45000, 56000, 68000, 90000, 61000, 79000,
               73000, 54000, 88000, 51000, 59000, 63000, 94000, 76000, 71000, 50000],
    'Department': ['Dat Science', 'Marketing', 'Finance', 'Engineering', 'Marketing', 'Sales', 'Engineering', 'Finance',
                   'Sales', 'Engineering', 'Finance', 'Engineering', 'Sales', 'Marketing', 'Marketing', 'Finance',
                   'Engineering', 'Marketing', 'Engineering', 'Sales']
}

# Creating a pandas DataFrame from the dictionary
df = pd.DataFrame(data)

# Printing the DataFrame
print(df)

        Name  Age  Salary   Department
0       Abhi   23  105000  Dat Science
1        Bob   34   65000    Marketing
2    Charlie   29   72000      Finance
3      David   45   82000  Engineering
4       Ella   21   45000    Marketing
5      Frank   26   56000        Sales
6       Gina   38   68000  Engineering
7      Henry   52   90000      Finance
8        Ivy   28   61000        Sales
9       John   41   79000  Engineering
10     Karen   37   73000      Finance
11      Liam   29   54000  Engineering
12      Mary   43   88000        Sales
13      Nate   25   51000    Marketing
14    Olivia   27   59000    Marketing
15     Peter   31   63000      Finance
16     Queen   46   94000  Engineering
17    Rachel   33   76000    Marketing
18  Samantha   39   71000  Engineering
19       Tom   22   50000        Sales

In [3]:
# Viewing the DataFrame
df.head()

      Name  Age  Salary   Department
0     Abhi   23  105000  Dat Science
1      Bob   34   65000    Marketing
2  Charlie   29   72000      Finance
3    David   45   82000  Engineering
4     Ella   21   45000    Marketing

In [4]:
df.tail()

        Name  Age  Salary   Department
15     Peter   31   63000      Finance
16     Queen   46   94000  Engineering
17    Rachel   33   76000    Marketing
18  Samantha   39   71000  Engineering
19       Tom   22   50000        Sales

In [5]:
# Selecting a column
column = df["Age"]
column

0     23
1     34
2     29
3     45
4     21
5     26
6     38
7     52
8     28
9     41
10    37
11    29
12    43
13    25
14    27
15    31
16    46
17    33
18    39
19    22
Name: Age, dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Age         20 non-null     int64
 2   Salary      20 non-null     int64
 3   Department  20 non-null     object
dtypes: int64(2), object(2)
memory usage: 768.0+ bytes

In [7]:
# Calculating summary statistics 
df.describe()

             Age         Salary
count  20.000000      20.000000
mean   33.450000   70100.000000
std     8.846498   16088.243501
min    21.000000   45000.000000
25%    26.750000   58250.000000
50%    32.000000   69500.000000
75%    39.500000   79750.000000
max    52.000000  105000.000000

In [8]:
df.shape

(20, 4)

In [9]:
df.nunique()

Name          20
Age           19
Salary        20
Department     5
dtype: int64

In [10]:
df.Age.unique()

array([23, 34, 29, 45, 21, 26, 38, 52, 28, 41, 37, 43, 25, 27, 31, 46, 33,
       39, 22])

In [11]:
df.Age.nunique()

19

# Merging and Joining DataFrames

In [12]:
# Creating two dataframes
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'key': ['K0', 'K1', 'K2', 'K3']})

df2 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3'],
                    'key': ['K0', 'K1', 'K2', 'K3']})

# Merging the dataframes on the key column
merged_df = pd.merge(df1, df2, on='key')

# Joining the dataframes on the index
df3 = pd.DataFrame({'E': ['E0', 'E1', 'E2', 'E3'],
                    'F': ['F0', 'F1', 'F2', 'F3']})

joined_df = df1.join(df3)

# Printing the original and modified dataframes
print(df1)
print(df2)
print(merged_df)
print(joined_df)

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3
    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3
    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
    A   B key   E   F
0  A0  B0  K0  E0  F0
1  A1  B1  K1  E1  F1
2  A2  B2  K2  E2  F2
3  A3  B3  K3  E3  F3

# Grouping and Aggregating Data

In [13]:
# Creating a dataframe
df = pd.DataFrame({'A': ['Abhi', 'jhon', 'Abhi', 'jhon', 'Abhi', 'jhon', 'jhon', 'Abhi'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': [1, 2, 3, 4, 5, 6, 7, 8],
                   'D': [10, 20, 30, 40, 50, 60, 70, 80]})

# Grouping the dataframe by column A and compute the mean of columns C and D for each group
grouped_df = df.groupby('A').agg({'C': 'mean', 'D': 'mean'})

# Printing the grouped dataframe
print(grouped_df)

         C     D
A
Abhi  4.25  42.5
jhon  4.75  47.5

# Reshaping and Pivoting Data

In [14]:
# Creating a dataframe
df = pd.DataFrame({'Ab': ['one', 'one', 'two', 'two', 'one', 'three', 'two', 'one'],
                   'Bc': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
                   'Cd': [1, 2, 3, 4, 5, 6, 7, 8]})

# Reshaping the dataframe from a long to a wide format
pivoted_df = df.pivot(index='Ab', columns='Bc', values='Cd')

# Printing the pivoted dataframe
print(pivoted_df)

Bc       A    B    C    D    E    F    G    H
Ab
one    1.0  2.0  NaN  NaN  5.0  NaN  NaN  8.0
three  NaN  NaN  NaN  NaN  NaN  6.0  NaN  NaN
two    NaN  NaN  3.0  4.0  NaN  NaN  7.0  NaN

# Handling Missing Data

In [15]:
import numpy as np
# Creating a dataframe with missing values
df = pd.DataFrame({'A': [1, 2, np.nan, 4],
                   'B': [5, np.nan, np.nan, 8],
                   'C': [9, 10, 11, 12]})

# Droping rows with missing values
dropped_df = df.dropna()

# Filling missing values with a specific value
filled_df = df.fillna(0)

# Interpolate missing values
interpolated_df = df.interpolate()

# Printing the original and modified dataframes
print(df)
print(dropped_df)
print(filled_df)
print(interpolated_df)

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12
     A    B   C
0  1.0  5.0   9
3  4.0  8.0  12
     A    B   C
0  1.0  5.0   9
1  2.0  0.0  10
2  0.0  0.0  11
3  4.0  8.0  12
     A    B   C
0  1.0  5.0   9
1  2.0  6.0  10
2  3.0  7.0  11
3  4.0  8.0  12

# Applying Functions to Data

In [16]:
# Creating a dataframe
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [5, 6, 7, 8],
                   'C': [9, 10, 11, 12]})

# Applying a function to each column
def add_one(x):
    return x + 1

applied_df = df.apply(add_one)

# Printing the original and modified dataframes
print(df)
print(applied_df)

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12
   A  B   C
0  2  6  10
1  3  7  11
2  4  8  12
3  5  9  13

# Time Series Analysis

In [17]:
# Creating a datetime index with hourly frequency
date_rng = pd.date_range(start='1/1/2022', end='1/10/2022', freq='H')

# Creating a DataFrame with datetime index and random values
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = np.random.randint(0,100,size=(len(date_rng)))

# Seting the datetime index
df.set_index('date', inplace=True)

# Resampling the data to daily frequency
daily_df = df.resample('D').sum()

# Computing a 7-day rolling average
rolling_avg_df = df.rolling(window=7).mean()

# Computing the mean, median and standard deviation for each month
monthly_stats = df.resample('M').agg(['mean', 'median', 'std'])

# Printing the results
print(df.head())
print(daily_df.head())
print(rolling_avg_df.head())
print(monthly_stats.head())

                     data
date
2022-01-01 00:00:00    24
2022-01-01 01:00:00    41
2022-01-01 02:00:00    79
2022-01-01 03:00:00     0
2022-01-01 04:00:00    60
            data
date
2022-01-01  1079
2022-01-02  1164
2022-01-03  1409
2022-01-04  1314
2022-01-05  1109
                     data
date
2022-01-01 00:00:00   NaN
2022-01-01 01:00:00   NaN
2022-01-01 02:00:00   NaN
2022-01-01 03:00:00   NaN
2022-01-01 04:00:00   NaN
                 data
                 mean median        std
date
2022-01-31  52.718894   54.0  27.491737